{
  "Banner": {
    "mainTitle": ["Desenvolvedor", "Front-End &", "UX/UI Design"]
  },
  "AboutMe": {
    "image": {
      "src": "/home/marcos-olhando-para-o-lado-esquerdo-em-um-fundo-azul.webp",
      "alt": "Homem chamado Marcos olhando para o lado esquerdo em um fundo azul",
      "title": "Marcos olhando para o lado esquerdo em um fundo azul",
      "width": 568,
      "height": 402
    },
    "title": "Sobre mim",
    "texts": [
      "Iniciei minha jornada na programação aos 14 anos e desde então, venho aprimorando minhas habilidades técnicas e criativas. Tenho experiência em programação front-end e UX/UI Design, o que me permite colaborar efetivamente com equipes de desenvolvimento, dando uma visão a mais de design. Além disso, estou sempre buscando expandir meu conhecimento em áreas como back-end e outras tecnologias emergentes.",
      "Como pessoa autista de suporte no grau 1, minha abordagem meticulosa aos projetos reflete meu compromisso em criar soluções que impactam positivamente a vida das pessoas. Cada solução que desenvolvo visa melhorar a experiência do usuário e tornar a tecnologia mais acessível e agradável."
    ],
    "stars": [
      "/icons/stars/white/star-average-no-tip-white.svg",
      "/icons/stars/white/star-average-white.svg",
      "/icons/stars/white/star-small-white.svg"
    ]
  },
  "Knowledges": {
    "title": "Conhecimentos",
    "knowledges": [
      "Next.js",
      "React.js",
      "TypeScript",
      "JavaScript",
      "SEO",
      "Git",
      "HTML",
      "SASS",
      "CSS",
      "Azure",
      "BootStrap",
      "Inglês B2",
      "UX/UI",
      "Figma"
    ]
  },
  "Projects": {
    "title": "Projetos",
    "projects": [
      {
        "subtitle": "Portfolio",
        "text": "Meu portfólio tem como objetivo mostrar minhas habilidades e projetos de forma criativa e inovadora.",
        "technologies": "React - Typescript - SASS - HTML - SEO - UX/UI - Figma",
        "link": "#",
        "image": {
          "src": "/home/portfolio.webp",
          "alt": "Imagem exemplo do meu portfolio, site que você está acessando agora",
          "title": "Imagem mostrando meu portfolio, site que você está acessando agora",
          "width": 750,
          "height": 312
        }
      },
      {
        "subtitle": "Cabana do Coelho",
        "text": "Tem o objetivo de proporcionar uma apresentação das cabanas disponíveis para aluguel",
        "technologies": "UX/UI - Figma - HTML - CSS - Javascript",
        "link": "https://cabana-do-coelho.vercel.app/",
        "createdForStudy": true,
        "image": {
          "src": "/home/cabanadocoelho.webp",
          "alt": "Imagem exemplo do site Cabana Do Coelho",
          "title": "Imagem mostrando site Cabana Do Coelho",
          "width": 615,
          "height": 313
        }
      },
      {
        "subtitle": "WaterSurf",
        "text": "O objetivo deste site é destacar o serviço de assistência técnica, visando aumentar a confiança de potenciais clientes.",
        "technologies": "UX/UI - Figma - HTML - CSS - JavaScript",
        "createdForStudy": true,
        "link": "https://water-surf.vercel.app/",
        "image": {
          "src": "/home/watersurf.webp",
          "alt": "Imagem exemplo do site Watersurf",
          "title": "Imagem mostrando site Watersurf",
          "width": 342,
          "height": 273
        }
      },
      {
        "subtitle": "CoelhoGames",
        "text": "O objetivo deste site é mostrar a assistencia tecnica para trazer maior confianca de possiveis clientes.",
        "technologies": "Figma - HTML - CSS - BootStrap",
        "createdForStudy": true,
        "link": "https://coelhogames.vercel.app/",
        "image": {
          "src": "/home/coelhogames.webp",
          "alt": "Imagem exemplo do site CoelhoGames",
          "title": "Imagem mostrando site CoelhoGames",
          "width": 350,
          "height": 277
        }
      }
    ]
  },
  "ExperienceAndAcademic": [
    {
      "title": "Experiência",
      "experiences": [
        {
          "info1": "Zenvia",
          "info2": "05/2024 - Momento",
          "info3": "Desenvolvedor",
          "texts": [
            "Atuo no desenvolvimento de produtos voltados à automação de comunicação, abrangendo canais como WhatsApp, RCS, e-mail e SMS, utilizando React e Next.js. Contribuo para a criação de interfaces e componentes complexos, reutilizáveis e alinhados às necessidades de diversos times.",
            "Sou responsável pela manutenção e evolução do produto “Docs”, com foco em segurança, performance e escalabilidade. Além disso, desenvolvi um BFF com autenticação, centralizando integrações e reforçando a segurança das soluções.",
            "Colaboro diretamente com PO, PM, Product Design, Back-End e SRE no planejamento, estimativas e alinhamento das entregas. Também apoio a gestão do time de Front-End, auxiliando na divisão de tarefas e oferecendo orientações técnicas durante o desenvolvimento."
          ]
        },
        {
          "info1": "OI S&A",
          "info2": "05/2023 - Momento",
          "info3": "Ass. de Desenvolvimento",
          "texts": [
            "Atuei de forma significativa na migração de páginas da tecnologia legada Vignette para Next.JS. Além disso, desenvolvi uma página intuitiva que facilita aos clientes a obtenção da segunda via de sua conta de internet, esse projeto teve diversos desafios relacionados a componentes variados e integrações com o backend.",
            "No meu dia a dia, utilizei: Next.JS, React.js, TypeScript, JSON para desenvolvimento e integração de dados, Azure para versionamento de código, SASS, HTML, JavaScript e Figma para trabalhar com interfaces criadas pelo time de UX. Além disso, tenho experiência com GitLab, AWS e Node.js."
          ]
        }
      ]
    },
    {
      "title": "Formação",
      "titleReverse": true,
      "experiences": [
        {
          "info1": "UNICSUL",
          "info2": "Superior",
          "info3": "Análise e Desenvolvimento de Sistemas",
          "info3Mobile": "ADS",
          "texts": [
            "Formação superior completa pela faculdade Cruzeiro do Sul com término no mês 06/2025"
          ],
          "buttonText": "Certificado",
          "buttonLink": "https://drive.google.com/file/d/1UvAq4O8PJNOjXwS3lhCm4psM38m9nH-n/view?usp=sharing"
        },
        {
          "info1": "TopWay",
          "info2": "Curso",
          "info3": "Inglês",
          "texts": [
            "Na TopWay, adquiri toda a base do idioma, o que hoje me permite ler textos com segurança, comunicar-me com boa fluidez e compreender falantes nativos em sua língua materna.",
            "Data de término: 03/2025"
          ],
          "buttonText": "Certificado",
          "buttonLink": "https://drive.google.com/file/d/1LDAObhne4eVQEpfm4sCW5qp1NakQS2Jp/view?usp=sharing"
        },
        {
          "info1": "Origamid",
          "info2": "Curso Online",
          "info3": "Front-End e UX/UI Design",
          "info3Mobile": "Front-End e UX/UI",
          "texts": [
            "O foco do curso em projetos práticos me permite aplicar rapidamente o que aprendo em situações reais, preparando-me para os desafios do mercado."
          ]
        }
      ]
    }
  ]
}
